Tekla.Structures.Model.Operations.Operation.ConvertPartToItem(Tekla.Structures.Model.Part@,Tekla.Structures.Model.Brep@)
originalPart: Original part
newItem: Newly created item
Throws System.ArgumentNullException: Thrown if the originalPart is null.